ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
/**
 ****************************************************************************************
 *
 * @file dialog_commands.c
 *
 * @brief dialog vendor specific command handlers project source code.
 *
 * Copyright (c) 2017-2019 Dialog Semiconductor. All rights reserved.
 *
 * This software ("Software") is owned by Dialog Semiconductor.
 *
 * By using this Software you agree that Dialog Semiconductor retains all
 * intellectual property and proprietary rights in and to this Software and any
 * use, reproduction, disclosure or distribution of the Software without express
 * written permission or a license agreement from Dialog Semiconductor is
 * strictly prohibited. This Software is solely for use on or in conjunction
 * with Dialog Semiconductor products.
 *
 * EXCEPT AS OTHERWISE PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, THE
 * SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. EXCEPT AS OTHERWISE
 * PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, IN NO EVENT SHALL
 * DIALOG SEMICONDUCTOR BE LIABLE FOR ANY DIRECT, SPECIAL, INDIRECT, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF
 * USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
 * TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE
 * OF THE SOFTWARE.
 *
 ****************************************************************************************
 */

 /*
 * INCLUDE FILES
 ****************************************************************************************
 */

#include "stdio.h"
#include "dialog_commands.h"
#include "hci_int.h"
#include "hci.h"
#include "co_hci.h"
#include "rwip.h"
#include "sdk_version.h"
#include "user_config_sw_ver.h"
#include "dialog_prod.h"
#ifndef __DA14531__
#include "rdtest_api.h"
#include "adc.h"
#endif
#include "user_periph_setup.h"
#include "otp_hdr.h"
#include "system_library.h"
#include "em_map.h"
#include "h4tl.h"
#include "uart.h"
#if defined (__DA14531__)
#include "Xtal_TRIM.h"
#endif
#include "llm.h"
#include "timer0.h"
#include "timer2.h"
#include "timer0_2.h"
#include "arch.h"
#include "arch_system.h"
#include "spi.h"
#include "i2c.h"

#if defined (__DA14531__)
#include "rf_531.h"
#endif

/*
 * DEFINES
 ****************************************************************************************
 */

// Value to generate 1s timeout when checking for a rising edge on the input pulse
#define PULSE_TIMEOUT    0x8CB6

// Maximum number of words that can be read or written by a command at once
#define MAX_READ_WRITE_OTP_WORDS 60

/*
 * GLOBAL VARIABLE DEFINITIONS
 ****************************************************************************************
 */

volatile uint8_t test_data_pattern;
volatile uint8_t test_freq;

/// Configuration struct for SPI bus.
static spi_cfg_t spi_cfg = {
    /// SPI master/slave mode
    .spi_ms = SPI_MS_MODE_MASTER,
    /// SPI clock mode (CPOL, CPHA)
    .spi_cp = SPI_CP_MODE_0,
    /// SPI master clock frequency
    .spi_speed = SPI_SPEED_MODE_2MHz,
    /// SPI word size (1, 2, 4 Bytes or 9 bits)
    .spi_wsz = SPI_MODE_8BIT,
    /// SPI master CS mode
    .spi_cs = SPI_CS_0,
    /// SPI Interrupt mode
    .spi_irq = SPI_IRQ_DISABLED,
    /// SPI CS Pad
    .cs_pad = {
        .port = GPIO_PORT_0,
        .pin = GPIO_PIN_1,
    },
#if (SPI_DMA_SUPPORT)
    /// SPI send callback
    .send_cb = ,
    /// SPI receive callback
    .receive_cb = ,
    /// SPI transfer callback
    .transfer_cb = ,
    /// SPI DMA Channel Pair Configuration
    .spi_dma_channel = ,
    /// SPI DMA Priority Configuration
    .spi_dma_priority = ,
#endif // SPI_DMA_SUPPORT
#ifdef __DA14531__
    /// SPI Capture at current or next edge.
    .spi_capture = SPI_MASTER_EDGE_CAPTURE,
#endif
};

/// Configuration struct for I2C bus.
static i2c_cfg_t i2c_cfg = {
    .clock_cfg.ss_hcnt = I2C_SS_SCL_HCNT_REG_RESET,
    .clock_cfg.ss_lcnt = I2C_SS_SCL_LCNT_REG_RESET,
    .clock_cfg.fs_hcnt = I2C_FS_SCL_HCNT_REG_RESET,
    .clock_cfg.fs_lcnt = I2C_FS_SCL_LCNT_REG_RESET,
    .restart_en = I2C_RESTART_ENABLE,
    .speed = I2C_SPEED_FAST,
    .mode = I2C_MODE_MASTER,
    .addr_mode = I2C_ADDRESSING_7B,
    .address = 0x00,
    .tx_fifo_level = 1,
    .rx_fifo_level = 1,
};

/*
 * LOCAL FUNCTIONS DECLARATIONS
 ****************************************************************************************
 */
extern uint32_t lp_clk_sel;
extern void uart_finish_transfers_func(void);
static uint8_t hci_otp_rd_data_cmd_cmp_evt_pk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len);
static uint8_t hci_wr_otp_cmd_upk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len);
static uint8_t hci_pack_bytes(uint8_t** pp_in, uint8_t** pp_out, uint8_t* p_in_end, uint8_t* p_out_end, uint8_t len);

// HCI dialog command descriptors (OGF Vendor Specific)
const struct hci_cmd_desc_tag hci_cmd_desc_tab_dialog_vs[] =
{
    CMD(CUSTOM_ACTION            , DBG, 0, PK_GEN_GEN, "B"                    , "L"                            ),
    CMD(SLEEP_TEST               , DBG, 0, PK_GEN_GEN, "BBB"                  , NULL                           ),
    CMD(XTAL_TRIM                , DBG, 0, PK_GEN_GEN, "3B"                   , "H"                            ),
    CMD(OTP_RW                   , DBG, 0, PK_GEN_GEN, "B6B"                  , "B6B"                          ),
    CMD(OTP_READ                 , DBG, 0, PK_GEN_SPE, "HB"                   , &hci_otp_rd_data_cmd_cmp_evt_pk),
    CMD(OTP_WRITE                , DBG, 0, PK_SPE_GEN, &hci_wr_otp_cmd_upk    , "BB"                           ),
    CMD(REGISTER_RW              , DBG, 0, PK_GEN_GEN, "BLL"                  , "BBL"                          ),
    CMD(AUDIO_TEST               , DBG, 0, PK_GEN_GEN, NULL                   , NULL                           ),
    CMD(FIRMWARE_VERSION_GET     , DBG, 0, PK_GEN_GEN, NULL                   , "66B"                          ),
    CMD(CHANGE_UART_PINS_ACTION  , DBG, 0, PK_GEN_GEN, "4B"                   , "H"                            ),
    CMD(RDTESTER                 , DBG, 0, PK_GEN_GEN, "BH"                   , NULL                           ),
    CMD(TX_TEST                  , DBG, 0, PK_GEN_GEN, "BBBBB"                , NULL                           ),
    CMD(START_PROD_RX_TEST       , DBG, 0, PK_GEN_GEN, "B"                    , NULL                           ),
    CMD(END_PROD_RX_TEST         , DBG, 0, PK_GEN_GEN, NULL                   , "HHHH"                         ),
    CMD(UNMODULATED_ON           , DBG, 0, PK_GEN_GEN, "BB"                   , NULL                           ),
    CMD(TX_START_CONTINUE_TEST   , DBG, 0, PK_GEN_GEN, "BB"                   , NULL                           ),
    CMD(TX_END_CONTINUE_TEST     , DBG, 0, PK_GEN_GEN, NULL                   , NULL                           ),
    CMD(SENSOR_TEST              , DBG, 0, PK_GEN_GEN, "17B"                  , "H"                            ),
    CMD(GPIO_SET                 , DBG, 0, PK_GEN_GEN, "6B"                   , "B"                            ),
    CMD(GPIO_READ                , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(UART_LOOP                , DBG, 0, PK_GEN_GEN, "100B"                 , "100B"                         ),
    CMD(UART_BAUD                , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(EXT32KHz_TEST            , DBG, 0, PK_GEN_GEN, NULL                   , "B"                            ),
    CMD(GPIO_WD                  , DBG, 0, PK_GEN_GEN, "2B"                   , "B"                            ),
    CMD(SLEEP_CLK_SEL            , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(ADC_VBAT                 , DBG, 0, PK_GEN_GEN, NULL                   , "H"                            ),
#if defined (__DA14531__)
    CMD(SET_TX_POWER             , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(CONFIGURE_TEST_MODE      , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
#endif
};

const uint8_t dialog_commands_num = ARRAY_LEN (hci_cmd_desc_tab_dialog_vs);

/**
 ****************************************************************************************
 * @brief Handles the reception of the ADC read VBAT value command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_adc_vbat_handler(ke_msg_id_t const msgid,
                                                 void const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_adc_vbat_dialog_cmd_cmp_evt *event =
        KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_ADC_VBAT_CMD_OPCODE, hci_adc_vbat_dialog_cmd_cmp_evt);

#if defined (__DA14531__)
    event->vbat_lvl = (uint16_t) adc_531_get_vbat_sample();
#else
    adc_offset_calibrate(ADC_INPUT_MODE_SINGLE_ENDED);
    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
    {
        // Boost mode
        event->vbat_lvl = (uint16_t) adc_get_vbat_sample(true);
    }
    else
    {
        // Buck mode
        event->vbat_lvl = (uint16_t) adc_get_vbat_sample(false);
    }
#endif

    hci_send_2_host(event);

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the custom_action dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_custom_action_handler(ke_msg_id_t const msgid,
                                                 struct hci_custom_action_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_custom_action_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CUSTOM_ACTION_CMD_OPCODE, hci_custom_action_dialog_cmd_cmp_evt);

    switch (param->inputData & 0x00FF)
    {
        /* Command 0x5F is used for UART resync test. */
        case 0x5F:
            event->returnData = param->inputData & 0x00FF;
            break;
        case 0x33:
            event->returnData = GetWord16(CLK_FREQ_TRIM_REG);
            break;
        /* Users can add their own commands and replies accordingly. */
        default:
            event->returnData = param->inputData & 0x00FF;
            break;
    }

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the audio_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_audio_test_handler(ke_msg_id_t const msgid,
                                              void const *param,
                                              ke_task_id_t const dest_id,
                                              ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_AUDIO_TEST_CMD_OPCODE, 0);

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the firmware_version dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_firmware_version_get_handler(ke_msg_id_t const msgid,
                                                        void const *param,
                                                        ke_task_id_t const dest_id,
                                                        ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_firmware_version_get_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_FIRMWARE_VERSION_GET_CMD_OPCODE, hci_firmware_version_get_dialog_cmd_cmp_evt);

    //adding return values
    event->ble_ver_len = sizeof(SDK_VERSION);
    strcpy(event->ble_ver, SDK_VERSION);

    event->app_ver_len = sizeof(DA14585_REFDES_SW_VERSION);
    strcpy(event->app_ver, DA14585_REFDES_SW_VERSION);

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the change_uart_pins_action dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_change_uart_pins_action_handler(ke_msg_id_t const msgid,
                                                           struct hci_change_uart_pins_action_dialog_cmd const *param,
                                                           ke_task_id_t const dest_id,
                                                           ke_task_id_t const src_id)
{
    // Structure type for the complete command event
    struct hci_change_uart_pins_action_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CHANGE_UART_PINS_ACTION_CMD_OPCODE, hci_change_uart_pins_action_dialog_cmd_cmp_evt);
    uint8_t data[4];
    data[0] = param->tx_port;
    data[1] = param->tx_pin;
    data[2] = param->rx_port;
    data[3] = param->rx_pin;
    // Check if new pins are valid
    event->status = check_uart_pins_cmd(data);
    // Send completion event
    hci_send_2_host(event);

    // Change to new pins if they are valid
    if (!event->status)
    {
        change_uart_pins_cmd(data);
    }

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the register_rw dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_register_rw_handler(ke_msg_id_t const msgid,
                                               struct hci_register_rw_dialog_cmd const *param,
                                               ke_task_id_t const dest_id,
                                               ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_register_rw_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_REGISTER_RW_CMD_OPCODE, hci_register_rw_dialog_cmd_cmp_evt);

    volatile void * reg_addr = 0;

