ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
        SetWord16(RF_SYNTH_CTRL3_REG, 0x4000);      //DISABLE MODULATION
        SetWord16(RF_OVERRULE_REG, RX_DIS_WR);      //DISABLE EVENTUAL RX
        SetWord16(RF_OVERRULE_REG, TX_EN_WR);       //ENABLE EVENTUAL TX
        test_state = STATE_UNMODULATED_ON;
#else
        configure_radio_ldo();
        apply_radio_arp_tx_configuration();

        // Enable ADPLL HCLK and reset ADPLL register file
        SetByte(RF_RADIO_INIT_REG + 0x1, (ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN) >> 8);
        
        SetWord32(ADPLL_CN_CTRL_REG, (2402 << 16) | CS | cn);
        SetWord32(RF_OVERRULE_REG, 3);   // OVERRULE TX ENABLED
        test_state = STATE_UNMODULATED_ON;
        start_refresh_timer();
#endif // __DA14531__

        cmd_flag=true;
        break;
    case UNMODULATED_CMD_MODE_RX: //UNMODULATED RX
        NVIC_DisableIRQ(BLE_RF_DIAG_IRQn);

        cn = param->frequency;

#if !defined (__DA14531__)

# if (LUT_PATCH_ENABLED)
        pLUT_CFG= &LUT_CFG;;
        if(!pLUT_CFG->HW_LUT_MODE) //so SW_LUT_MODE
        {
            set_rf_cal_cap(cn);
            SetBits16(RF_BMCW_REG, CN_SEL,1);                                 // ENABLE OVERRULE CN_SEL IS 1
            SetBits16(RF_BMCW_REG, CN_WR, cn);
        }
        else //so HW_LUT_MODE
        {
        //HW
            uint8_t * BLE_freq_tbl;
            BLE_freq_tbl = (uint8_t *)(_ble_base + EM_FT_OFFSET); // = EM base address + Frequency Table offset
            SetBits16(RF_BMCW_REG, CN_SEL,1);                                 // ENABLE OVERRULE CN_SEL IS 1
            SetBits16(RF_BMCW_REG, CN_WR, BLE_freq_tbl[cn]);
        }
# else //NO LUT
        SetBits16(RF_BMCW_REG, CN_SEL,1);                                     // ENABLE OVERRULE CN_SEL IS 1
        SetBits16(RF_BMCW_REG, CN_WR, cn);
# endif

        SetWord16(RF_SYNTH_CTRL3_REG, 0x4000);      //DISABLE MODULATION
        SetWord16(RF_OVERRULE_REG, TX_DIS_WR);      //DISABLE EVENTUAL TX
        SetWord16(RF_OVERRULE_REG, RX_EN_WR);       //ENABLE EVENTUAL RX
        test_state = STATE_UNMODULATED_ON;
#else
        configure_radio_ldo();

        struct hci_le_rx_test_cmd  rx_con_test;
        rx_con_test.rx_freq = cn; 
        llm_test_mode_start_rx( (struct hci_le_rx_test_cmd const *)&rx_con_test);   
        SetBits32(BLE_RFTESTCNTL_REG,INFINITERX, 1);
        
        test_state = STATE_UNMODULATED_RX_ON;
        
        start_refresh_timer();
#endif // __DA14531__

        cmd_flag=true;
        break;
    default:
        break;
    }

    if(cmd_flag)
    {
        hci_send_2_host(event);
    }

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the tx_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_tx_test_handler(ke_msg_id_t const msgid,
                                           struct hci_tx_test_dialog_cmd const *param,
                                           ke_task_id_t const dest_id,
                                           ke_task_id_t const src_id)
{
    test_freq = param->frequency;
    test_data_len = param->data_length;
    test_data_pattern = param->payload_type;
    text_tx_nr_of_packets = (param->NpacketsMSB<<8) | param->NpacketsLSB;
    set_state_start_tx();

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the sleep_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_sleep_test_handler(ke_msg_id_t const msgid,
                                              struct hci_sleep_test_dialog_cmd const *param,
                                              ke_task_id_t const dest_id,
                                              ke_task_id_t const src_id)
{
    // structure type for the status event
    struct hci_cmd_stat_event *event = KE_MSG_ALLOC(HCI_CMD_STAT_EVENT , src_id, HCI_SLEEP_TEST_CMD_OPCODE, hci_cmd_stat_event);

    event->status = 0x00;
    hci_send_2_host(event);

    // Finish current UART transfer
    uart_finish_transfers_func();

    switch(param->sleep_mode)
    {
    case CMD__SLEEP_MODE_ACTIVE:
        arch_disable_sleep();
        break;
    case CMD__SLEEP_MODE_EXTENDED:
        // Disable UART pins.
        unset_pad_uart();
        if (param->mins_to_sleep == 0 && param->seconds_to_sleep == 0)
        {
            rwip_env.ext_wakeup_enable = 2;
        }
        else
        {
             rwip_env.ext_wakeup_enable = 1;
             rom_cfg_table[max_sleep_duration_periodic_wakeup_pos] = param->mins_to_sleep * 1600 * 60 + param->seconds_to_sleep * 1600;
        }
        arch_set_extended_sleep(false); // no OTP copy
        break;
    case CMD__SLEEP_MODE_DEEP:
        // Disable UART pins.
        unset_pad_uart();
#if defined (__DA14531__)
        arch_set_deep_sleep(PD_SYS_DOWN_RAM_OFF, PD_SYS_DOWN_RAM_OFF, PD_SYS_DOWN_RAM_OFF, false);
#else
        arch_set_deep_sleep(false);
#endif
        break;
    default:
        break;
    }

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the rdtest dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_rdtester_handler(ke_msg_id_t const msgid,
                                            struct hci_rdtest_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_RDTESTER_CMD_OPCODE, 0);

    switch(param->operation)
    {
#if !defined (__DA14531__)
    case RDTESTER_INIT:
        rdtest_initialize(param->data & 0x00FF);
        break;
    case RDTESTER_UART_CONNECT:
        rdtest_uart_connect(param->data);
        break;
    case RDTESTER_UART_LOOPBACK:
        rdtest_make_loopback(param->data & 0x00FF);
        break;
    case RDTESTER_VBAT_CNTRL:
        rdtest_vbatcontrol(param->data);
        rdtest_uart_connect(param->data);
        break;
    case RDTESTER_VPP_CNTRL:
        rdtest_vppcontrol(param->data & 0x00FF);
        break;
    case RDTESTER_RST_PULSE:
        rdtest_resetpulse(param->data);
        break;
    case RDTESTER_UART_PULSE:
        rdtest_pulse_to_uart(param->data);
        if (param->data)
        {
            rdtest_generate_pulse();
        }
        else
        {
            rdtest_select_pulsewidth(0);
        }
        break;
    case RDTESTER_XTAL_PULSE:
        rdtest_generate_pulse();
        break;
    case RDTESTER_PULSE_WIDTH:
        rdtest_select_pulsewidth(param->data & 0x00FF);
        break;
#else
//DO NOTHING IN 531
#endif //!defined (__DA14531__)

    default:
        break;
    }

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the otp_read dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_otp_read_handler(ke_msg_id_t const msgid,
                                            struct hci_otp_read_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_otp_read_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_OTP_READ_CMD_OPCODE, hci_otp_read_dialog_cmd_cmp_evt);
    uint8_t length = 0;
    uint16_t init_addr = 0;
    uint8_t val[4];
    uint32_t i = 0;

    init_addr = param->address;
    length = param->num_of_words;

    /* Check that data length is null or bigger than 60*/
    if ((length == 0) || (length > MAX_READ_WRITE_OTP_WORDS))
    {
        event->status = CO_ERROR_INVALID_HCI_PARAM;
    }
    else
    {
        for (i = 0; i < length; i++)
        {
           otp_read(MEMORY_OTP_BASE + init_addr + (i*4) , val , 4);
           event->wordbyte[i*4]     = val[0];
           event->wordbyte[(i*4)+1] = val[1];
           event->wordbyte[(i*4)+2] = val[2];
           event->wordbyte[(i*4)+3] = val[3];
        }
         event->status = CO_ERROR_NO_ERROR;
    }

