ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    /* Transform the input. */
#if defined(__DA14531__)
    port = GPIO_PORT_0;
    pin = (GPIO_PIN) (param->gpio_pad);
#else
    port = (GPIO_PORT) (param->gpio_pad / 10);
    pin = (GPIO_PIN) (param->gpio_pad % 10);
#endif
    volt_rail = param->gpio_lvl;
    state = param->val;
    pwm = param->pwm;
    duty_cycle = param->duty_cycle;

    /* Validate the GPIO. */
    if (!GPIO_is_valid(port, pin))
    {
        err = 1;
    }

     /* Transform and validate the GPIO mode. */
     switch (param->mode)
     {
         case 0: mode = INPUT; break;
         case 1: mode = INPUT_PULLUP; break;
         case 2: mode = INPUT_PULLDOWN; break;
         case 3: mode = OUTPUT; break;
         default: err = 1; break;
     }

     /* Validate the GPIO voltage rail. 0 = 3.3V, 1 = 1.8V. */
    if (volt_rail > 1)
    {
        err = 1;
    }

      /* 0=Reset, 1=Set. Only valid in output mode. */
    if ((state > 1) && (param->mode >= OUTPUT))
    {
        err = 1;
    }

    /* Validate duty cycle. */
    if (duty_cycle > 100)
    {
        err = 1;
    }

    /* If error exists in the received message, reply with error. */
    if (err)
    {
        event->error = 0xFF;
        hci_send_2_host(event);
        return (KE_MSG_CONSUMED);
    }

#if defined (__DA14531__) && defined (CFG_HW_RESET_P00)
    // Disable hw_reset functionality.
    if ((port == GPIO_PORT_0) && (pin == GPIO_PIN_0))
    {
        GPIO_Disable_HW_Reset();
    }
#endif

#if !defined (__DA14531__)
    if ((port == GPIO_PORT_1 && pin == GPIO_PIN_4) ||
        (port == GPIO_PORT_1 && pin == GPIO_PIN_5))
#else
    uint8_t debugger_enable = GetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE);

    if ( port == GPIO_PORT_0 &&
        (( pin == GPIO_PIN_2 ) ||
         ( debugger_enable == 1 && (pin == GPIO_PIN_5 )) ||
         ( debugger_enable == 2 && (pin == GPIO_PIN_1 )) ||
         ( debugger_enable == 3 && (pin == GPIO_PIN_10)) ) )
#endif
    {
        // Disable JTAG for using the pins as GPIOs.
        while (GetBits16(SYS_STAT_REG, DBG_IS_UP) != 0);
        SetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE, 0);
    }

    if (pwm > 0)
    {
        /* State=0 -> PWM stop. State=1 -> PWM start. */
        switch (state)
        {
            case 0: // Stop Timer2.
            {
                timer2_stop();
                GPIO_ConfigurePin(port, pin, INPUT_PULLDOWN, PID_GPIO, false);
                GPIO_ConfigurePinPower(port, pin, volt_rail ? GPIO_POWER_RAIL_1V : GPIO_POWER_RAIL_3V);
                break;
            }
            case 1: // Start PWM2.
            {
                GPIO_ConfigurePin(port, pin, OUTPUT, PID_PWM2, false);
                GPIO_ConfigurePinPower(port, pin, volt_rail ? GPIO_POWER_RAIL_1V : GPIO_POWER_RAIL_3V);

                tim0_2_clk_div_config_t tim0_2_clk_div_config = {.clk_div = TIM0_2_CLK_DIV_8};

                // Enable TIMER0 clock.
                timer0_2_clk_enable();

                // Sets TIMER0,TIMER2 clock division factor to 8, so TIM0 Fclk is F = 16MHz/8 = 2Mhz.
                timer0_2_clk_div_set(&tim0_2_clk_div_config);

                tim2_pwm_config_t tim2_pwm_config = {
                                                        .pwm_signal = TIM2_PWM_2,
                                                        .pwm_dc = duty_cycle,
#if defined (__DA14531__)
                                                        .pwm_offset = 0
#endif
                                                    };
                tim2_config_t tim2_config = {
#if defined (__DA14531__)
                                                .clk_source = TIM2_CLK_SYS,
#endif
                                                .hw_pause = TIM2_HW_PAUSE_OFF
                                            };

                timer2_config(&tim2_config);
                timer2_pwm_freq_set(pwm*1000, 2000000);
                timer2_pwm_signal_config(&tim2_pwm_config);

                timer2_start();
                break;
            }
            default:
            {
                err = 1;
                break;
            }
        }
    }
    else
    {
        GPIO_ConfigurePin( port, pin, mode, PID_GPIO, state==1 ? true : false);
        GPIO_ConfigurePinPower(port, pin, volt_rail ? GPIO_POWER_RAIL_1V : GPIO_POWER_RAIL_3V);
    }

#if defined (__DA14531__) && defined (CFG_HW_RESET_P00)
    // Restore hw_reset functionality.
    set_hw_reset();
#endif

    event->error = (err==1) ? 0xFF : 0x00;
    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the gpio_read dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_gpio_read_handler(ke_msg_id_t const msgid,
                                            struct hci_gpio_read_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // structure type for the status event
    struct hci_gpio_read_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT ,src_id, HCI_GPIO_READ_CMD_OPCODE, hci_gpio_read_dialog_cmd_cmp_evt);
    uint8_t err = 0x00;
    GPIO_PORT port;
    GPIO_PIN pin;

    /* Transform the input. */
#if defined(__DA14531__)
    port = GPIO_PORT_0;
    pin = (GPIO_PIN) (param->gpio_pad);
#else
    port = (GPIO_PORT) (param->gpio_pad / 10);
    pin = (GPIO_PIN) (param->gpio_pad % 10);
#endif

     /* Validate the GPIO pin. */
    if(!GPIO_is_valid(port, pin))
    {
        err = 1;
    }

    /* If error exists in the received message, reply with error. */
    if (err)
    {
        event->data = 0xFF;
    }
    else
    {
        event->data = GPIO_GetPinStatus( port, pin);
    }

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the uart_loop dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_uart_loop_handler(ke_msg_id_t const msgid,
                                            struct hci_uart_loop_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // structure type for the status event
    struct hci_uart_loop_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT ,src_id, HCI_UART_LOOP_CMD_OPCODE, hci_uart_loop_dialog_cmd_cmp_evt);

    memcpy(event->data, param->data, sizeof(event->data));

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the uart_baud dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_uart_baud_handler(ke_msg_id_t const msgid,
                                            struct hci_uart_baud_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // Structure type for the status event.
    struct hci_uart_baud_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_UART_BAUD_CMD_OPCODE, hci_uart_baud_dialog_cmd_cmp_evt);

    if ((param->data == 5) ||
        (param->data == 4) ||
        (param->data == 3) ||
        (param->data == 2) ||
        (param->data == 1) ||
        (param->data == 0))
        event->error = 0;
    else event->error = 1;

    hci_send_2_host(event);
    uart_finish_transfers_func();

