ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    for (volatile int i=0; i<200; i++) {}; // Wait some time for UART reset.

    switch (param->data)
    {
        case 5:
            baud_rate_sel = UART_BAUDRATE_38K4;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_38K4;
            break;
        case 4:
            baud_rate_sel = UART_BAUDRATE_1M;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_1M;
            break;
        case 3:
            baud_rate_sel = UART_BAUDRATE_115K2;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_115K2;
            break;
        case 2:
            baud_rate_sel = UART_BAUDRATE_57K6;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_57K6;
            break;
        case 1:
            baud_rate_sel = UART_BAUDRATE_19K2;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_19K2;
            break;
        case 0:
            baud_rate_sel = UART_BAUDRATE_9K6;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_9K6;
            break;
        default:
            baud_rate_sel = UART_BAUDRATE_115K2;
            baud_rate_frac_sel = UART_FRAC_BAUDRATE_115K2;
            break;
    }
    uart_init(baud_rate_sel, baud_rate_frac_sel, UART_CHARFORMAT_8);

    h4tl_init(rwip_eif_get(RWIP_EIF_HCIC));

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the watchdog GPIO dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_gpio_wd_handler(ke_msg_id_t const msgid,
                                           struct hci_gpio_wd_dialog_cmd const *param,
                                           ke_task_id_t const dest_id,
                                           ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_gpio_wd_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_GPIO_WD_CMD_OPCODE, hci_gpio_wd_dialog_cmd_cmp_evt);
    uint8_t err = 0x00;
    GPIO_PORT port;
    GPIO_PIN pin;
    uint8_t volt_rail;

    /* Transform the input. */
#if defined(__DA14531__)
    port = GPIO_PORT_0;
    pin = (GPIO_PIN) (param->gpio_pad);
#else
    port = (GPIO_PORT) (param->gpio_pad / 10);
    pin = (GPIO_PIN) (param->gpio_pad % 10);
#endif
    volt_rail = param->gpio_lvl;

    /* Validate the GPIO voltage rail. 0 = 3.3V, 1 = 1.8V. */
    if (volt_rail > 1)
    {
        err = 1;
    }

    /* Validate the GPIO port/pin. */
    if (!GPIO_is_valid(port, pin))
    {
        err = 1;
    }

#if defined (__DA14531__) && defined (CFG_HW_RESET_P00)
    // Disable hw_reset functionality.
    if ((port == GPIO_PORT_0) && (pin == GPIO_PIN_0))
    {
        GPIO_Disable_HW_Reset();
    }
#endif

#if !defined (__DA14531__)
    if ((port == GPIO_PORT_1 && pin == GPIO_PIN_4) ||
        (port == GPIO_PORT_1 && pin == GPIO_PIN_5))
#else
    uint8_t debugger_enable = GetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE);
    
    if ( port == GPIO_PORT_0 && 
        (( pin == GPIO_PIN_2 ) || 
         ( debugger_enable == 1 && (pin == GPIO_PIN_5 )) ||
         ( debugger_enable == 2 && (pin == GPIO_PIN_1 )) ||
         ( debugger_enable == 3 && (pin == GPIO_PIN_10)) ) )
#endif
    {
        // Disable JTAG for using the pins as GPIOs.
        while (GetBits16(SYS_STAT_REG, DBG_IS_UP) != 0);
        SetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE, 0);
    }

    /* Check for error. Send error and return. */
    if (err)
    {
        event->error = 0xFF;
        hci_send_2_host(event);
        return (KE_MSG_CONSUMED);
    }

    WD_port = port;
    WD_pin = pin;
    WD_volt_rail = volt_rail;

    gpio_wd_timer0_start();

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the external 32KHz crystal dialog hci test command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_ext32khz_test_handler(ke_msg_id_t const msgid,
                                                 void const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_ext32khz_test_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_EXT32KHz_TEST_CMD_OPCODE, hci_ext32khz_test_dialog_cmd_cmp_evt);
    int k = 0;

#ifdef __DA14531__
    bool xtal_enabled = (GetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE) == 1);

    // Enable XTAL32K if not enabled.
    if (!xtal_enabled)
    {
        SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 0x1); // Enables the 32kHz XTAL oscillator.
        SetBits16(CLK_XTAL32K_REG, XTAL32K_CUR, 5);
        SetBits16(CLK_XTAL32K_REG, XTAL32K_RBIAS, 3);

        for (int i=0; i<16*200000/6; i++); // 200msec
    }

    if (GetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE) == 1)
#endif
    {
        // Calibration operation to understand if external 32KHz is mounted.
        SetBits16(CLK_REF_CNT_REG, REF_CNT_VAL, 1);
#ifdef __DA14531__
        SetBits16(CLK_REF_SEL_REG, EXT_CNT_EN_SEL, 0x00);
#endif
        SetBits16(CLK_REF_SEL_REG, REF_CLK_SEL, 0x2);   // XTAL32KHz select

        SetBits16(CLK_REF_SEL_REG, REF_CAL_START, 0x1); // Start calibration.

        k = 0;
        while ((GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1) && (k<100)) {
            k++;
            for (int i=0; i<16*100/6; i++); // 100usec
        }

        if (GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1)
            event->error = 0xFF;
        else event->error = 0;
    }
#ifdef __DA14531__
    else
    {
        event->error = 0xFF;
    }
#endif

#ifdef __DA14531__
    // Restore XTAL32K state
    if (!xtal_enabled)
    {
        SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 0x0);
    }
#endif

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the sleep clock selection dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_sleep_clk_sel_handler(ke_msg_id_t const msgid,
                                                 struct hci_sleep_clk_sel_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_sleep_clk_sel_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_SLEEP_CLK_SEL_CMD_OPCODE, hci_sleep_clk_sel_dialog_cmd_cmp_evt);
    event->error = 0x00;

#if defined (__DA14531__)
//DO NOTHING IN 531
#else
    // LP_CLK_XTAL32
    if (param->sleep_clk == 0x1)
    {
        lp_clk_sel = LP_CLK_XTAL32;
        SetBits16(CLK_32K_REG, XTAL32K_ENABLE, 1);  // Enable XTAL32KHz

        // Disable XTAL32 amplitude regulation in BOOST mode
        if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
            SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 1);
        else
            SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 0);
        SetBits16(CLK_32K_REG,  XTAL32K_CUR, 5);
        SetBits16(CLK_32K_REG,  XTAL32K_RBIAS, 3);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 1);  // Select XTAL32K as LP clock
    // LP_CLK_RCX20
    }else if (param->sleep_clk == 0x0)
    {
        lp_clk_sel = LP_CLK_RCX20;
        SetBits16(CLK_RCX20K_REG, RCX20K_NTC, 0xB);
        SetBits16(CLK_RCX20K_REG, RCX20K_BIAS, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_TRIM, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_LOWF, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_ENABLE, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_SELECT, 1);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 0); // Select RCX as LP clock
        rcx20_calibrate();
    }
    else event->error = 0xFF;
#endif

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

#if defined (__DA14531__)

extern void rf_reinit(void);

static int dialog_commands_set_tx_power_handler(ke_msg_id_t const msgid,
                                            struct hci_set_tx_power_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // Structure type for the status event.
    struct hci_set_tx_power_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_SET_TX_POWER_CMD_OPCODE, hci_set_tx_power_dialog_cmd_cmp_evt);

    event->error = 0;

    hci_send_2_host(event);

    rf_pa_pwr_set((rf_tx_pwr_lvl_t)param->data);

    rf_reinit();    // Update radio and ADPLL settings

    return (KE_MSG_CONSUMED);
}

