ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
static int dialog_commands_configure_test_mode_handler(ke_msg_id_t const msgid,
                                            struct hci_configure_test_mode_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // Structure type for the status event.
    struct hci_configure_test_mode_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_CONFIGURE_TEST_MODE_CMD_OPCODE, hci_configure_test_mode_dialog_cmd_cmp_evt);

    event->error = 0;

    set_radio_ldo_configuration(param->data != 0);

    hci_send_2_host(event);

    switch (param->data)
    {

    }

    return (KE_MSG_CONSUMED);
}

#endif // __DA14531__

/// Special unpacking function for HCI Debug Write OTP Command
static uint8_t hci_wr_otp_cmd_upk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len)
{
    struct hci_otp_write_dialog_cmd* cmd = (struct hci_otp_write_dialog_cmd*) out;
    uint8_t* p_in = in;
    uint8_t* p_out = out;
    uint8_t* p_in_end = in + in_len;
    uint8_t* p_out_end = out + *out_len;
    uint8_t status = HCI_PACK_OK;

    // Check if there is input data to parse
    if(in != NULL)
    {
        do
        {
            uint8_t data_len;

            // Start address
            p_out = (uint8_t*) &cmd->start_addr;
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, 2);
            if(status != HCI_PACK_OK)
                break;

            // Data length
            data_len = *p_in;
            p_out = &cmd->num_of_words;
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, 1);
            if(status != HCI_PACK_OK)
                break;

            // Data
            data_len *= 4;
            p_out = &cmd->wordbyte[0];
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, data_len);
            if(status != HCI_PACK_OK)
                break;

        } while(0);

        *out_len =  (uint16_t)(p_out - out);
    }
    else
    {
        // If no input data, size max is returned
        *out_len = sizeof(struct hci_dbg_wr_mem_cmd);
    }

    return status;
}

/// Special packing function for Command Complete Event of HCI  Read otp Command
static uint8_t hci_otp_rd_data_cmd_cmp_evt_pk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len)
{
    struct hci_otp_read_dialog_cmd_cmp_evt* evt = (struct hci_otp_read_dialog_cmd_cmp_evt*)(in);
    uint8_t* p_in = in;
    uint8_t* p_out = out;
    uint8_t* p_in_end = in + in_len;
    uint8_t* p_out_end = out + *out_len;
    uint8_t status = HCI_PACK_OK;

    // Check if there is input data to parse
    if(in != NULL)
    {
        do
        {
            uint8_t data_len;

            // Status
            p_in = &evt->status;
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, 1);
            if(status != HCI_PACK_OK)
                break;

            // Number of Words
            p_in = &evt->num_of_words;
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, 1);
            if(status != HCI_PACK_OK)
                break;

            // Words
            data_len = evt->num_of_words * 4;
            p_in = &evt->wordbyte[0];
            status = hci_pack_bytes(&p_in, &p_out, p_in_end, p_out_end, data_len);
            if(status != HCI_PACK_OK)
                break;

        } while(0);

        *out_len =  (uint16_t)(p_out - out);
    }
    else
    {
        *out_len = 0;
    }

    return status;
}

/**
****************************************************************************************
* @brief Apply a basic pack operation
*
* @param[inout] pp_in      Current input buffer position
* @param[inout] pp_out     Current output buffer position
* @param[in]    p_in_end   Input buffer end
* @param[in]    p_out_end  Output buffer end
* @param[in]    len        Number of bytes to copy
*
* @return status
*****************************************************************************************
*/
static uint8_t hci_pack_bytes(uint8_t** pp_in, uint8_t** pp_out, uint8_t* p_in_end, uint8_t* p_out_end, uint8_t len)
{
    uint8_t status = HCI_PACK_OK;
    // Check if enough space in input buffer to read
    if((*pp_in + len) > p_in_end)
    {
        status = HCI_PACK_IN_BUF_OVFLW;
    }
    else
    {
        if(p_out_end != NULL)
        {
            // Check if enough space in out buffer to write
            if((*pp_out + len) > p_out_end)
            {
                status = HCI_PACK_OUT_BUF_OVFLW;
            }

            // Copy bytes
            memcpy(*pp_out, *pp_in, len);
        }
        *pp_in = (*pp_in + len);
        *pp_out = *pp_out + len;
    }

    return status;
}
// The message handlers for dialog HCI command complete events
const struct ke_msg_handler dialog_commands_handler_tab[] =
{
        {HCI_CUSTOM_ACTION_CMD_OPCODE           ,  (ke_msg_func_t)dialog_commands_custom_action_handler          },
        {HCI_SLEEP_TEST_CMD_OPCODE              ,  (ke_msg_func_t)dialog_commands_sleep_test_handler             },
        {HCI_XTAL_TRIM_CMD_OPCODE               ,  (ke_msg_func_t)dialog_commands_xtal_trim_handler              },
        {HCI_OTP_RW_CMD_OPCODE                  ,  (ke_msg_func_t)dialog_commands_otp_rw_handler                 },
        {HCI_OTP_READ_CMD_OPCODE                ,  (ke_msg_func_t)dialog_commands_otp_read_handler               },
        {HCI_OTP_WRITE_CMD_OPCODE               ,  (ke_msg_func_t)dialog_commands_otp_write_handler              },
        {HCI_REGISTER_RW_CMD_OPCODE             ,  (ke_msg_func_t)dialog_commands_register_rw_handler            },
        {HCI_AUDIO_TEST_CMD_OPCODE              ,  (ke_msg_func_t)dialog_commands_audio_test_handler             },
        {HCI_FIRMWARE_VERSION_GET_CMD_OPCODE    ,  (ke_msg_func_t)dialog_commands_firmware_version_get_handler   },
        {HCI_CHANGE_UART_PINS_ACTION_CMD_OPCODE ,  (ke_msg_func_t)dialog_commands_change_uart_pins_action_handler},
        {HCI_RDTESTER_CMD_OPCODE                ,  (ke_msg_func_t)dialog_commands_rdtester_handler               },
        {HCI_TX_TEST_CMD_OPCODE                 ,  (ke_msg_func_t)dialog_commands_tx_test_handler                },
        {HCI_START_PROD_RX_TEST_CMD_OPCODE      ,  (ke_msg_func_t)dialog_commands_start_prod_rx_test_handler     },
        {HCI_END_PROD_RX_TEST_CMD_OPCODE        ,  (ke_msg_func_t)dialog_commands_end_prod_rx_test_handler       },
        {HCI_UNMODULATED_ON_CMD_OPCODE          ,  (ke_msg_func_t)dialog_commands_unmodulated_on_handler         },
        {HCI_TX_START_CONTINUE_TEST_CMD_OPCODE  ,  (ke_msg_func_t)dialog_commands_tx_start_continue_test_handler },
        {HCI_TX_END_CONTINUE_TEST_CMD_OPCODE    ,  (ke_msg_func_t)dialog_commands_tx_end_continue_test_handler   },
        {HCI_SENSOR_TEST_CMD_OPCODE             ,  (ke_msg_func_t)dialog_commands_sensor_test_handler            },
        {HCI_GPIO_SET_CMD_OPCODE                ,  (ke_msg_func_t)dialog_commands_gpio_set_handler               },
        {HCI_GPIO_READ_CMD_OPCODE               ,  (ke_msg_func_t)dialog_commands_gpio_read_handler              },
        {HCI_UART_LOOP_CMD_OPCODE               ,  (ke_msg_func_t)dialog_commands_uart_loop_handler              },
        {HCI_UART_BAUD_CMD_OPCODE               ,  (ke_msg_func_t)dialog_commands_uart_baud_handler              },
        {HCI_EXT32KHz_TEST_CMD_OPCODE           ,  (ke_msg_func_t)dialog_commands_ext32khz_test_handler          },
        {HCI_GPIO_WD_CMD_OPCODE                 ,  (ke_msg_func_t)dialog_commands_gpio_wd_handler                },
        {HCI_SLEEP_CLK_SEL_CMD_OPCODE           ,  (ke_msg_func_t)dialog_commands_sleep_clk_sel_handler          },
        {HCI_ADC_VBAT_CMD_OPCODE                ,  (ke_msg_func_t)dialog_commands_adc_vbat_handler               },
#if defined (__DA14531__)
        {HCI_SET_TX_POWER_CMD_OPCODE            ,  (ke_msg_func_t)dialog_commands_set_tx_power_handler           },
        {HCI_CONFIGURE_TEST_MODE_CMD_OPCODE     ,  (ke_msg_func_t)dialog_commands_configure_test_mode_handler    },
#endif
};

const uint8_t dialog_commands_handler_num = ARRAY_LEN (dialog_commands_handler_tab);
